# parameters
#!!!!!!!!!!!!!  voc 20 coco 80
nc: 80  # number of classes  #
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple

# anchors
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Focus, [64, 3]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 9, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 1, SPP, [1024, [5, 9, 13]]],
   [-1, 3, C3, [1024, False]],  # 9
  ]

# YOLOv5 head
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [512, False]],  # 13

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [256, False]],  # 17 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 14], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [512, False]],  # 20 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 10], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [1024, False]],  # 23 (P5/32-large)

   [[17, 20, 23], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]

# for prune
# prune_rate: #20% 16.6 GFLOPS-> 13.2 GFLOPS   7114785->6174975
#   [[0.],
#    [0.1],  #Conv 0.1
#    [0.6],  #C3
#    [0.1],  #Conv
#    [0.6],  #C3   
#    [0.1],  #Conv  5
#    [0.6],  #C3
#    [0.],  #Conv
#    [0.],   #SPP
#    [0.4],  #C3
#    [0.],   #Conv  10
#    [0.],   #Upsample
#    [0.],   #Concat
#    [0.4],  #C3
#    [0.],   #Conv
#    [0.],   #Upsample  15
#    [0.],   #Concat
#    [0.4],  #C3
#    [0.],   #Conv
#    [0.],   #Concat
#    [0.2],  #C3    20
#    [0.],   #Conv
#    [0.],   #Concat
#    [0.2],  #C3
#    [0.],   #Detect  24
#   ]

# #for prune
prune_rate: #30%   16.6 GFLPOS -> 11.6 GFLOPS  7114785 -> 5532345
  [[0.],
   [0.3],  #Conv 0.1
   [0.6],  #C3
   [0.3],  #Conv
   [0.6],  #C3   
   [0.3],  #Conv  5
   [0.7],  #C3
   [0.],  #Conv
   [0.],   #SPP
   [0.6],  #C3
   [0.],   #Conv  10
   [0.],   #Upsample
   [0.],   #Concat
   [0.6],  #C3
   [0.],   #Conv
   [0.],   #Upsample  15
   [0.],   #Concat
   [0.6],  #C3
   [0.],   #Conv
   [0.],   #Concat
   [0.6],  #C3    20
   [0.],   #Conv
   [0.],   #Concat
   [0.6],  #C3
   [0.],   #Detect  24
  ]

# #for prune  test
# prune_rate: #30% 
#   [[0.],
#    [0.1],  #Conv 0.1
#    [0.],  #C3
#    [0.],  #Conv
#    [0.],  #C3   
#    [0.],  #Conv  5
#    [0.],  #C3
#    [0.],  #Conv
#    [0.],   #SPP
#    [0.],  #C3
#    [0.],   #Conv  10
#    [0.],   #Upsample
#    [0.],   #Concat
#    [0.],  #C3
#    [0.],   #Conv
#    [0.],   #Upsample  15
#    [0.],   #Concat
#    [0.],  #C3
#    [0.],   #Conv
#    [0.],   #Concat
#    [0.],  #C3    20
#    [0.],   #Conv
#    [0.],   #Concat
#    [0.],  #C3
#    [0.],   #Detect  24
#   ]

# prune_rate: #40%   16.6 GFLPOS -> 9.9 GFLOPS  7114785 -> 5008277
#   [[0.],
#    [0.4],  #Conv 0.1
#    [0.85],  #C3
#    [0.4],  #Conv
#    [0.85],  #C3   
#    [0.4],  #Conv  5
#    [0.85],  #C3
#    [0.],  #Conv
#    [0.],   #SPP
#    [0.85],  #C3
#    [0.],   #Conv  10
#    [0.],   #Upsample
#    [0.],   #Concat
#    [0.8],  #C3
#    [0.],   #Conv
#    [0.],   #Upsample  15
#    [0.],   #Concat
#    [0.8],  #C3
#    [0.],   #Conv
#    [0.],   #Concat
#    [0.8],  #C3    20
#    [0.],   #Conv
#    [0.],   #Concat
#    [0.8],  #C3
#    [0.],   #Detect  24
#   ]